LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#ifndef __AW_PID_2055_REG_H__
#define __AW_PID_2055_REG_H__


/* registers list */
#define AW_PID_2055_ID_REG			(0x00)
#define AW_PID_2055_SYSST_REG			(0x01)
#define AW_PID_2055_SYSINT_REG			(0x02)
#define AW_PID_2055_SYSINTM_REG			(0x03)
#define AW_PID_2055_SYSCTRL_REG			(0x04)
#define AW_PID_2055_SYSCTRL2_REG		(0x05)
#define AW_PID_2055_I2SCTRL1_REG		(0x06)
#define AW_PID_2055_I2SCTRL2_REG		(0x07)
#define AW_PID_2055_I2SCTRL3_REG		(0x08)
#define AW_PID_2055_DACCFG1_REG			(0x09)
#define AW_PID_2055_DACCFG2_REG			(0x0A)
#define AW_PID_2055_DACCFG3_REG			(0x0B)
#define AW_PID_2055_DACCFG4_REG			(0x0C)
#define AW_PID_2055_DACCFG5_REG			(0x0D)
#define AW_PID_2055_DACCFG6_REG			(0x0E)
#define AW_PID_2055_DACCFG7_REG			(0x0F)
#define AW_PID_2055_DACCFG8_REG			(0x10)
#define AW_PID_2055_PWMCTRL1_REG		(0x11)
#define AW_PID_2055_PWMCTRL2_REG		(0x12)
#define AW_PID_2055_PWMCTRL3_REG		(0x13)
#define AW_PID_2055_PWMCTRL4_REG		(0x14)
#define AW_PID_2055_PWMCTRL5_REG		(0x15)
#define AW_PID_2055_I2SCFG1_REG			(0x16)
#define AW_PID_2055_DBGCTRL_REG			(0x17)
#define AW_PID_2055_DITHERCFG1_REG		(0x18)
#define AW_PID_2055_DACST_REG			(0x20)
#define AW_PID_2055_VBAT_REG			(0x21)
#define AW_PID_2055_TEMP_REG			(0x22)
#define AW_PID_2055_PVDD_REG			(0x23)
#define AW_PID_2055_BOPST_REG			(0x24)
#define AW_PID_2055_I2SINT_REG			(0x25)
#define AW_PID_2055_I2SCAPCNT_REG		(0x26)
#define AW_PID_2055_ANASTA1_REG			(0x27)
#define AW_PID_2055_ANASTA2_REG			(0x28)
#define AW_PID_2055_ANASTA3_REG			(0x29)
#define AW_PID_2055_DSMCFG1_REG			(0x30)
#define AW_PID_2055_DSMCFG2_REG			(0x31)
#define AW_PID_2055_DSMCFG3_REG			(0x32)
#define AW_PID_2055_DSMCFG4_REG			(0x33)
#define AW_PID_2055_DSMCFG5_REG			(0x34)
#define AW_PID_2055_DSMCFG6_REG			(0x35)
#define AW_PID_2055_DSMCFG7_REG			(0x36)
#define AW_PID_2055_DSMCFG8_REG			(0x37)
#define AW_PID_2055_TESTIN_REG			(0x38)
#define AW_PID_2055_TESTOUT_REG			(0x39)
#define AW_PID_2055_SADCCTRL1_REG		(0x3A)
#define AW_PID_2055_SADCCTRL2_REG		(0x3B)
#define AW_PID_2055_SADCCTRL3_REG		(0x3C)
#define AW_PID_2055_SADCCTRL4_REG		(0x3D)
#define AW_PID_2055_SADCCTRL5_REG		(0x3E)
#define AW_PID_2055_SADCCTRL6_REG		(0x3F)
#define AW_PID_2055_PLLCTRL1_REG		(0x50)
#define AW_PID_2055_PLLCTRL2_REG		(0x51)
#define AW_PID_2055_PLLCTRL3_REG		(0x52)
#define AW_PID_2055_CDACTRL1_REG		(0x53)
#define AW_PID_2055_CDACTRL2_REG		(0x54)
#define AW_PID_2055_CDACTRL3_REG		(0x55)
#define AW_PID_2055_BSTCTRL1_REG		(0x60)
#define AW_PID_2055_BSTCTRL2_REG		(0x61)
#define AW_PID_2055_BSTCTRL3_REG		(0x62)
#define AW_PID_2055_BSTCTRL4_REG		(0x63)
#define AW_PID_2055_BSTCTRL5_REG		(0x64)
#define AW_PID_2055_BSTCTRL6_REG		(0x65)
#define AW_PID_2055_BSTCTRL7_REG		(0x66)
#define AW_PID_2055_BSTCTRL8_REG		(0x67)
#define AW_PID_2055_CPCTRL1_REG			(0x68)
#define AW_PID_2055_TESTCTRL1_REG		(0x70)
#define AW_PID_2055_TESTCTRL2_REG		(0x71)
#define AW_PID_2055_EFCTRL1_REG			(0x72)
#define AW_PID_2055_EFCTRL2_REG			(0x73)
#define AW_PID_2055_EFWH_REG			(0x74)
#define AW_PID_2055_EFWL_REG			(0x75)
#define AW_PID_2055_EFRH2_REG			(0x76)
#define AW_PID_2055_EFRL2_REG			(0x77)
#define AW_PID_2055_EFRH1_REG			(0x78)
#define AW_PID_2055_EFRL1_REG			(0x79)
#define AW_PID_2055_TM_REG			(0x7C)

/********************************************
 * Register Access
 *******************************************/
#define AW_PID_2055_REG_MAX				(0x7D)

#define AW_PID_2055_REG_NONE_ACCESS			(0)
#define AW_PID_2055_REG_RD_ACCESS			(1 << 0)
#define AW_PID_2055_REG_WR_ACCESS			(1 << 1)

const unsigned char aw_pid_2055_reg_access[AW_PID_2055_REG_MAX] = {
	[AW_PID_2055_ID_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_SYSST_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_SYSINT_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_SYSINTM_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SYSCTRL_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SYSCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_I2SCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_I2SCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_I2SCTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG4_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG5_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG6_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG7_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACCFG8_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PWMCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PWMCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PWMCTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PWMCTRL4_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PWMCTRL5_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_I2SCFG1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DBGCTRL_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DITHERCFG1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DACST_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_VBAT_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_TEMP_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_PVDD_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_BOPST_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_I2SINT_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_I2SCAPCNT_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_ANASTA1_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_ANASTA2_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_ANASTA3_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_DSMCFG1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG4_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG5_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG6_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG7_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_DSMCFG8_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_TESTIN_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_TESTOUT_REG]	= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_SADCCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SADCCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SADCCTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SADCCTRL4_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SADCCTRL5_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_SADCCTRL6_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PLLCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PLLCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_PLLCTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_CDACTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_CDACTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_CDACTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL3_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL4_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL5_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL6_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL7_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_BSTCTRL8_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_CPCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_TESTCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_TESTCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_EFCTRL1_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_EFCTRL2_REG]	= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_EFWH_REG]		= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_EFWL_REG]		= (AW_PID_2055_REG_RD_ACCESS | AW_PID_2055_REG_WR_ACCESS),
	[AW_PID_2055_EFRH2_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_EFRL2_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_EFRH1_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_EFRL1_REG]		= (AW_PID_2055_REG_RD_ACCESS),
	[AW_PID_2055_TM_REG]		= (AW_PID_2055_REG_NONE_ACCESS),
};

/* detail information of registers begin */
/* ID (0x00) detail */
/* IDCODE bit 15:0 (ID 0x00) */
#define AW_PID_2055_IDCODE_START_BIT	(0)
#define AW_PID_2055_IDCODE_BITS_LEN		(16)
#define AW_PID_2055_IDCODE_MASK			\
	(~(((1<<AW_PID_2055_IDCODE_BITS_LEN)-1) << AW_PID_2055_IDCODE_START_BIT))

#define AW_PID_2055_IDCODE_DEFAULT_VALUE	(0x2055)
#define AW_PID_2055_IDCODE_DEFAULT		\
	(AW_PID_2055_IDCODE_DEFAULT_VALUE << AW_PID_2055_IDCODE_START_BIT)

/* default value of ID (0x00) */
/* #define AW_PID_2055_ID_DEFAULT		(0x2055) */

/* SYSST (0x01) detail */
/* OVP2 bit 15 (SYSST 0x01) */
#define AW_PID_2055_OVP2_START_BIT		(15)
#define AW_PID_2055_OVP2_BITS_LEN		(1)
#define AW_PID_2055_OVP2_MASK			\
	(~(((1<<AW_PID_2055_OVP2_BITS_LEN)-1) << AW_PID_2055_OVP2_START_BIT))

#define AW_PID_2055_OVP2_NORMAL			(0)
#define AW_PID_2055_OVP2_NORMAL_VALUE	\
	(AW_PID_2055_OVP2_NORMAL << AW_PID_2055_OVP2_START_BIT)

#define AW_PID_2055_OVP2_OVP			(1)
#define AW_PID_2055_OVP2_OVP_VALUE		\
	(AW_PID_2055_OVP2_OVP << AW_PID_2055_OVP2_START_BIT)

