LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
/* PLLS bit 0 (SYSST 0x01) */
#define AW_PID_2055_PLLS_START_BIT		(0)
#define AW_PID_2055_PLLS_BITS_LEN		(1)
#define AW_PID_2055_PLLS_MASK			\
	(~(((1<<AW_PID_2055_PLLS_BITS_LEN)-1) << AW_PID_2055_PLLS_START_BIT))

#define AW_PID_2055_PLLS_UNLOCKED		(0)
#define AW_PID_2055_PLLS_UNLOCKED_VALUE	\
	(AW_PID_2055_PLLS_UNLOCKED << AW_PID_2055_PLLS_START_BIT)

#define AW_PID_2055_PLLS_LOCKED			(1)
#define AW_PID_2055_PLLS_LOCKED_VALUE	\
	(AW_PID_2055_PLLS_LOCKED << AW_PID_2055_PLLS_START_BIT)

#define AW_PID_2055_PLLS_DEFAULT_VALUE	(0)
#define AW_PID_2055_PLLS_DEFAULT		\
	(AW_PID_2055_PLLS_DEFAULT_VALUE << AW_PID_2055_PLLS_START_BIT)

/* default value of SYSST (0x01) */
/* #define AW_PID_2055_SYSST_DEFAULT		(0x0000) */
#define AW_PID_2055_SYSST_CHECK_MASK \
	(~(AW_PID_2055_UVLS_UVLO_VALUE | \
	AW_PID_2055_BSTOCS_OVER_CURRENT_VALUE | \
	AW_PID_2055_BSTS_FINISHED_VALUE | \
	AW_PID_2055_SWS_SWITCHING_VALUE | \
	AW_PID_2055_NOCLKS_NO_CLOCK_VALUE | \
	AW_PID_2055_CLKS_STABLE_VALUE | \
	AW_PID_2055_OCDS_OC_VALUE | \
	AW_PID_2055_OTHS_OT_VALUE | \
	AW_PID_2055_PLLS_LOCKED_VALUE))

#define AW_PID_2055_SYSST_CHECK \
	(AW_PID_2055_BSTS_FINISHED_VALUE | \
	AW_PID_2055_CLKS_STABLE_VALUE | \
	AW_PID_2055_PLLS_LOCKED_VALUE)

#define AW_PID_2055_IIS_CHECK \
	(AW_PID_2055_CLKS_STABLE_VALUE | \
	AW_PID_2055_PLLS_LOCKED_VALUE)

/* SYSINT (0x02) detail */
/* OVP2I bit 15 (SYSINT 0x02) */
#define AW_PID_2055_OVP2I_START_BIT		(15)
#define AW_PID_2055_OVP2I_BITS_LEN		(1)
#define AW_PID_2055_OVP2I_MASK			\
	(~(((1<<AW_PID_2055_OVP2I_BITS_LEN)-1) << AW_PID_2055_OVP2I_START_BIT))

#define AW_PID_2055_OVP2I_DEFAULT_VALUE	(0)
#define AW_PID_2055_OVP2I_DEFAULT		\
	(AW_PID_2055_OVP2I_DEFAULT_VALUE << AW_PID_2055_OVP2I_START_BIT)

/* UVLI bit 14 (SYSINT 0x02) */
#define AW_PID_2055_UVLI_START_BIT		(14)
#define AW_PID_2055_UVLI_BITS_LEN		(1)
#define AW_PID_2055_UVLI_MASK			\
	(~(((1<<AW_PID_2055_UVLI_BITS_LEN)-1) << AW_PID_2055_UVLI_START_BIT))

#define AW_PID_2055_UVLI_DEFAULT_VALUE	(0)
#define AW_PID_2055_UVLI_DEFAULT		\
	(AW_PID_2055_UVLI_DEFAULT_VALUE << AW_PID_2055_UVLI_START_BIT)

/* ADPI bit 13 (SYSINT 0x02) */
#define AW_PID_2055_ADPI_START_BIT		(13)
#define AW_PID_2055_ADPI_BITS_LEN		(1)
#define AW_PID_2055_ADPI_MASK			\
	(~(((1<<AW_PID_2055_ADPI_BITS_LEN)-1) << AW_PID_2055_ADPI_START_BIT))

#define AW_PID_2055_ADPI_DEFAULT_VALUE	(0)
#define AW_PID_2055_ADPI_DEFAULT		\
	(AW_PID_2055_ADPI_DEFAULT_VALUE << AW_PID_2055_ADPI_START_BIT)

/* BSTOCI bit 11 (SYSINT 0x02) */
#define AW_PID_2055_BSTOCI_START_BIT	(11)
#define AW_PID_2055_BSTOCI_BITS_LEN		(1)
#define AW_PID_2055_BSTOCI_MASK			\
	(~(((1<<AW_PID_2055_BSTOCI_BITS_LEN)-1) << AW_PID_2055_BSTOCI_START_BIT))

#define AW_PID_2055_BSTOCI_DEFAULT_VALUE	(0)
#define AW_PID_2055_BSTOCI_DEFAULT		\
	(AW_PID_2055_BSTOCI_DEFAULT_VALUE << AW_PID_2055_BSTOCI_START_BIT)

/* OVPI bit 10 (SYSINT 0x02) */
#define AW_PID_2055_OVPI_START_BIT		(10)
#define AW_PID_2055_OVPI_BITS_LEN		(1)
#define AW_PID_2055_OVPI_MASK			\
	(~(((1<<AW_PID_2055_OVPI_BITS_LEN)-1) << AW_PID_2055_OVPI_START_BIT))

#define AW_PID_2055_OVPI_DEFAULT_VALUE	(0)
#define AW_PID_2055_OVPI_DEFAULT		\
	(AW_PID_2055_OVPI_DEFAULT_VALUE << AW_PID_2055_OVPI_START_BIT)

/* BSTI bit 9 (SYSINT 0x02) */
#define AW_PID_2055_BSTI_START_BIT		(9)
#define AW_PID_2055_BSTI_BITS_LEN		(1)
#define AW_PID_2055_BSTI_MASK			\
	(~(((1<<AW_PID_2055_BSTI_BITS_LEN)-1) << AW_PID_2055_BSTI_START_BIT))

#define AW_PID_2055_BSTI_DEFAULT_VALUE	(0)
#define AW_PID_2055_BSTI_DEFAULT		\
	(AW_PID_2055_BSTI_DEFAULT_VALUE << AW_PID_2055_BSTI_START_BIT)

/* SWI bit 8 (SYSINT 0x02) */
#define AW_PID_2055_SWI_START_BIT		(8)
#define AW_PID_2055_SWI_BITS_LEN		(1)
#define AW_PID_2055_SWI_MASK			\
	(~(((1<<AW_PID_2055_SWI_BITS_LEN)-1) << AW_PID_2055_SWI_START_BIT))

#define AW_PID_2055_SWI_DEFAULT_VALUE	(0)
#define AW_PID_2055_SWI_DEFAULT			\
	(AW_PID_2055_SWI_DEFAULT_VALUE << AW_PID_2055_SWI_START_BIT)

/* NOCLKI bit 5 (SYSINT 0x02) */
#define AW_PID_2055_NOCLKI_START_BIT	(5)
#define AW_PID_2055_NOCLKI_BITS_LEN		(1)
#define AW_PID_2055_NOCLKI_MASK			\
	(~(((1<<AW_PID_2055_NOCLKI_BITS_LEN)-1) << AW_PID_2055_NOCLKI_START_BIT))

#define AW_PID_2055_NOCLKI_DEFAULT_VALUE	(0)
#define AW_PID_2055_NOCLKI_DEFAULT		\
	(AW_PID_2055_NOCLKI_DEFAULT_VALUE << AW_PID_2055_NOCLKI_START_BIT)

/* CLKI bit 4 (SYSINT 0x02) */
#define AW_PID_2055_CLKI_START_BIT		(4)
#define AW_PID_2055_CLKI_BITS_LEN		(1)
#define AW_PID_2055_CLKI_MASK			\
	(~(((1<<AW_PID_2055_CLKI_BITS_LEN)-1) << AW_PID_2055_CLKI_START_BIT))

#define AW_PID_2055_CLKI_DEFAULT_VALUE	(0)
#define AW_PID_2055_CLKI_DEFAULT		\
	(AW_PID_2055_CLKI_DEFAULT_VALUE << AW_PID_2055_CLKI_START_BIT)

/* OCDI bit 3 (SYSINT 0x02) */
#define AW_PID_2055_OCDI_START_BIT		(3)
#define AW_PID_2055_OCDI_BITS_LEN		(1)
#define AW_PID_2055_OCDI_MASK			\
	(~(((1<<AW_PID_2055_OCDI_BITS_LEN)-1) << AW_PID_2055_OCDI_START_BIT))

#define AW_PID_2055_OCDI_DEFAULT_VALUE	(0)
#define AW_PID_2055_OCDI_DEFAULT		\
	(AW_PID_2055_OCDI_DEFAULT_VALUE << AW_PID_2055_OCDI_START_BIT)

/* BROWN_OUTI bit 2 (SYSINT 0x02) */
#define AW_PID_2055_BROWN_OUTI_START_BIT	(2)
#define AW_PID_2055_BROWN_OUTI_BITS_LEN	(1)
#define AW_PID_2055_BROWN_OUTI_MASK		\
	(~(((1<<AW_PID_2055_BROWN_OUTI_BITS_LEN)-1) << AW_PID_2055_BROWN_OUTI_START_BIT))

#define AW_PID_2055_BROWN_OUTI_DEFAULT_VALUE	(0)
#define AW_PID_2055_BROWN_OUTI_DEFAULT	\
	(AW_PID_2055_BROWN_OUTI_DEFAULT_VALUE << AW_PID_2055_BROWN_OUTI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_2055_OTHI_START_BIT		(1)
#define AW_PID_2055_OTHI_BITS_LEN		(1)
#define AW_PID_2055_OTHI_MASK			\
	(~(((1<<AW_PID_2055_OTHI_BITS_LEN)-1) << AW_PID_2055_OTHI_START_BIT))

#define AW_PID_2055_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_2055_OTHI_DEFAULT		\
	(AW_PID_2055_OTHI_DEFAULT_VALUE << AW_PID_2055_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_2055_PLLI_START_BIT		(0)
#define AW_PID_2055_PLLI_BITS_LEN		(1)
#define AW_PID_2055_PLLI_MASK			\
	(~(((1<<AW_PID_2055_PLLI_BITS_LEN)-1) << AW_PID_2055_PLLI_START_BIT))

#define AW_PID_2055_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_2055_PLLI_DEFAULT		\
	(AW_PID_2055_PLLI_DEFAULT_VALUE << AW_PID_2055_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_2055_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_2055_OVP2M_START_BIT		(15)
#define AW_PID_2055_OVP2M_BITS_LEN		(1)
#define AW_PID_2055_OVP2M_MASK			\
	(~(((1<<AW_PID_2055_OVP2M_BITS_LEN)-1) << AW_PID_2055_OVP2M_START_BIT))

