LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_2055_OVP2M_DEFAULT		\
	(AW_PID_2055_OVP2M_DEFAULT_VALUE << AW_PID_2055_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_2055_UVLM_START_BIT		(14)
#define AW_PID_2055_UVLM_BITS_LEN		(1)
#define AW_PID_2055_UVLM_MASK			\
	(~(((1<<AW_PID_2055_UVLM_BITS_LEN)-1) << AW_PID_2055_UVLM_START_BIT))

#define AW_PID_2055_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_2055_UVLM_DEFAULT		\
	(AW_PID_2055_UVLM_DEFAULT_VALUE << AW_PID_2055_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_2055_ADPM_START_BIT		(13)
#define AW_PID_2055_ADPM_BITS_LEN		(1)
#define AW_PID_2055_ADPM_MASK			\
	(~(((1<<AW_PID_2055_ADPM_BITS_LEN)-1) << AW_PID_2055_ADPM_START_BIT))

#define AW_PID_2055_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_2055_ADPM_DEFAULT		\
	(AW_PID_2055_ADPM_DEFAULT_VALUE << AW_PID_2055_ADPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_2055_BSTOCM_START_BIT	(11)
#define AW_PID_2055_BSTOCM_BITS_LEN		(1)
#define AW_PID_2055_BSTOCM_MASK			\
	(~(((1<<AW_PID_2055_BSTOCM_BITS_LEN)-1) << AW_PID_2055_BSTOCM_START_BIT))

#define AW_PID_2055_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_2055_BSTOCM_DEFAULT		\
	(AW_PID_2055_BSTOCM_DEFAULT_VALUE << AW_PID_2055_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_2055_OVPM_START_BIT		(10)
#define AW_PID_2055_OVPM_BITS_LEN		(1)
#define AW_PID_2055_OVPM_MASK			\
	(~(((1<<AW_PID_2055_OVPM_BITS_LEN)-1) << AW_PID_2055_OVPM_START_BIT))

#define AW_PID_2055_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_2055_OVPM_DEFAULT		\
	(AW_PID_2055_OVPM_DEFAULT_VALUE << AW_PID_2055_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_2055_BSTM_START_BIT		(9)
#define AW_PID_2055_BSTM_BITS_LEN		(1)
#define AW_PID_2055_BSTM_MASK			\
	(~(((1<<AW_PID_2055_BSTM_BITS_LEN)-1) << AW_PID_2055_BSTM_START_BIT))

#define AW_PID_2055_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_2055_BSTM_DEFAULT		\
	(AW_PID_2055_BSTM_DEFAULT_VALUE << AW_PID_2055_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_2055_SWM_START_BIT		(8)
#define AW_PID_2055_SWM_BITS_LEN		(1)
#define AW_PID_2055_SWM_MASK			\
	(~(((1<<AW_PID_2055_SWM_BITS_LEN)-1) << AW_PID_2055_SWM_START_BIT))

#define AW_PID_2055_SWM_DEFAULT_VALUE	(1)
#define AW_PID_2055_SWM_DEFAULT			\
	(AW_PID_2055_SWM_DEFAULT_VALUE << AW_PID_2055_SWM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_2055_NOCLKM_START_BIT	(5)
#define AW_PID_2055_NOCLKM_BITS_LEN		(1)
#define AW_PID_2055_NOCLKM_MASK			\
	(~(((1<<AW_PID_2055_NOCLKM_BITS_LEN)-1) << AW_PID_2055_NOCLKM_START_BIT))

#define AW_PID_2055_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_2055_NOCLKM_DEFAULT		\
	(AW_PID_2055_NOCLKM_DEFAULT_VALUE << AW_PID_2055_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_2055_CLKM_START_BIT		(4)
#define AW_PID_2055_CLKM_BITS_LEN		(1)
#define AW_PID_2055_CLKM_MASK			\
	(~(((1<<AW_PID_2055_CLKM_BITS_LEN)-1) << AW_PID_2055_CLKM_START_BIT))

#define AW_PID_2055_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_2055_CLKM_DEFAULT		\
	(AW_PID_2055_CLKM_DEFAULT_VALUE << AW_PID_2055_CLKM_START_BIT)

/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_2055_OCDM_START_BIT		(3)
#define AW_PID_2055_OCDM_BITS_LEN		(1)
#define AW_PID_2055_OCDM_MASK			\
	(~(((1<<AW_PID_2055_OCDM_BITS_LEN)-1) << AW_PID_2055_OCDM_START_BIT))

#define AW_PID_2055_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_2055_OCDM_DEFAULT		\
	(AW_PID_2055_OCDM_DEFAULT_VALUE << AW_PID_2055_OCDM_START_BIT)

/* BROWN_OUTM bit 2 (SYSINTM 0x03) */
#define AW_PID_2055_BROWN_OUTM_START_BIT	(2)
#define AW_PID_2055_BROWN_OUTM_BITS_LEN	(1)
#define AW_PID_2055_BROWN_OUTM_MASK		\
	(~(((1<<AW_PID_2055_BROWN_OUTM_BITS_LEN)-1) << AW_PID_2055_BROWN_OUTM_START_BIT))

#define AW_PID_2055_BROWN_OUTM_DEFAULT_VALUE	(1)
#define AW_PID_2055_BROWN_OUTM_DEFAULT	\
	(AW_PID_2055_BROWN_OUTM_DEFAULT_VALUE << AW_PID_2055_BROWN_OUTM_START_BIT)

/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_2055_OTHM_START_BIT		(1)
#define AW_PID_2055_OTHM_BITS_LEN		(1)
#define AW_PID_2055_OTHM_MASK			\
	(~(((1<<AW_PID_2055_OTHM_BITS_LEN)-1) << AW_PID_2055_OTHM_START_BIT))

#define AW_PID_2055_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_2055_OTHM_DEFAULT		\
	(AW_PID_2055_OTHM_DEFAULT_VALUE << AW_PID_2055_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_2055_PLLM_START_BIT		(0)
#define AW_PID_2055_PLLM_BITS_LEN		(1)
#define AW_PID_2055_PLLM_MASK			\
	(~(((1<<AW_PID_2055_PLLM_BITS_LEN)-1) << AW_PID_2055_PLLM_START_BIT))

#define AW_PID_2055_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_2055_PLLM_DEFAULT		\
	(AW_PID_2055_PLLM_DEFAULT_VALUE << AW_PID_2055_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
#define AW_PID_2055_SYSINTM_DEFAULT		(0xEF3F)

/* SYSCTRL (0x04) detail */
/* ULS_MODE bit 14 (SYSCTRL 0x04) */
#define AW_PID_2055_ULS_MODE_START_BIT	(14)
#define AW_PID_2055_ULS_MODE_BITS_LEN	(1)
#define AW_PID_2055_ULS_MODE_MASK		\
	(~(((1<<AW_PID_2055_ULS_MODE_BITS_LEN)-1) << AW_PID_2055_ULS_MODE_START_BIT))

#define AW_PID_2055_ULS_MODE_LEGACY		(0)
#define AW_PID_2055_ULS_MODE_LEGACY_VALUE	\
	(AW_PID_2055_ULS_MODE_LEGACY << AW_PID_2055_ULS_MODE_START_BIT)

#define AW_PID_2055_ULS_MODE_TDM		(1)
#define AW_PID_2055_ULS_MODE_TDM_VALUE	\
	(AW_PID_2055_ULS_MODE_TDM << AW_PID_2055_ULS_MODE_START_BIT)

#define AW_PID_2055_ULS_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2055_ULS_MODE_DEFAULT	\
	(AW_PID_2055_ULS_MODE_DEFAULT_VALUE << AW_PID_2055_ULS_MODE_START_BIT)

/* SPK_GAIN bit 13 (SYSCTRL 0x04) */
#define AW_PID_2055_SPK_GAIN_START_BIT	(13)
#define AW_PID_2055_SPK_GAIN_BITS_LEN	(1)
#define AW_PID_2055_SPK_GAIN_MASK		\
	(~(((1<<AW_PID_2055_SPK_GAIN_BITS_LEN)-1) << AW_PID_2055_SPK_GAIN_START_BIT))

#define AW_PID_2055_SPK_GAIN_6_AV		(0)
#define AW_PID_2055_SPK_GAIN_6_AV_VALUE	\
	(AW_PID_2055_SPK_GAIN_6_AV << AW_PID_2055_SPK_GAIN_START_BIT)

#define AW_PID_2055_SPK_GAIN_12AV		(1)
#define AW_PID_2055_SPK_GAIN_12AV_VALUE	\
	(AW_PID_2055_SPK_GAIN_12AV << AW_PID_2055_SPK_GAIN_START_BIT)

