LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_SPK_GAIN_DEFAULT_VALUE	(1)
#define AW_PID_2055_SPK_GAIN_DEFAULT	\
	(AW_PID_2055_SPK_GAIN_DEFAULT_VALUE << AW_PID_2055_SPK_GAIN_START_BIT)

/* RCV_GAIN bit 12 (SYSCTRL 0x04) */
#define AW_PID_2055_RCV_GAIN_START_BIT	(12)
#define AW_PID_2055_RCV_GAIN_BITS_LEN	(1)
#define AW_PID_2055_RCV_GAIN_MASK		\
	(~(((1<<AW_PID_2055_RCV_GAIN_BITS_LEN)-1) << AW_PID_2055_RCV_GAIN_START_BIT))

#define AW_PID_2055_RCV_GAIN_4P5		(0)
#define AW_PID_2055_RCV_GAIN_4P5_VALUE	\
	(AW_PID_2055_RCV_GAIN_4P5 << AW_PID_2055_RCV_GAIN_START_BIT)

#define AW_PID_2055_RCV_GAIN_6P7		(1)
#define AW_PID_2055_RCV_GAIN_6P7_VALUE	\
	(AW_PID_2055_RCV_GAIN_6P7 << AW_PID_2055_RCV_GAIN_START_BIT)

#define AW_PID_2055_RCV_GAIN_DEFAULT_VALUE	(0)
#define AW_PID_2055_RCV_GAIN_DEFAULT	\
	(AW_PID_2055_RCV_GAIN_DEFAULT_VALUE << AW_PID_2055_RCV_GAIN_START_BIT)

/* RMSE bit 11 (SYSCTRL 0x04) */
#define AW_PID_2055_RMSE_START_BIT		(11)
#define AW_PID_2055_RMSE_BITS_LEN		(1)
#define AW_PID_2055_RMSE_MASK			\
	(~(((1<<AW_PID_2055_RMSE_BITS_LEN)-1) << AW_PID_2055_RMSE_START_BIT))

#define AW_PID_2055_RMSE_PEAK_AGC		(0)
#define AW_PID_2055_RMSE_PEAK_AGC_VALUE	\
	(AW_PID_2055_RMSE_PEAK_AGC << AW_PID_2055_RMSE_START_BIT)

#define AW_PID_2055_RMSE_RMS_AGC		(1)
#define AW_PID_2055_RMSE_RMS_AGC_VALUE	\
	(AW_PID_2055_RMSE_RMS_AGC << AW_PID_2055_RMSE_START_BIT)

#define AW_PID_2055_RMSE_DEFAULT_VALUE	(0)
#define AW_PID_2055_RMSE_DEFAULT		\
	(AW_PID_2055_RMSE_DEFAULT_VALUE << AW_PID_2055_RMSE_START_BIT)

/* HAGCE bit 10 (SYSCTRL 0x04) */
#define AW_PID_2055_HAGCE_START_BIT		(10)
#define AW_PID_2055_HAGCE_BITS_LEN		(1)
#define AW_PID_2055_HAGCE_MASK			\
	(~(((1<<AW_PID_2055_HAGCE_BITS_LEN)-1) << AW_PID_2055_HAGCE_START_BIT))

#define AW_PID_2055_HAGCE_DISABLE		(0)
#define AW_PID_2055_HAGCE_DISABLE_VALUE	\
	(AW_PID_2055_HAGCE_DISABLE << AW_PID_2055_HAGCE_START_BIT)

#define AW_PID_2055_HAGCE_ENABLE		(1)
#define AW_PID_2055_HAGCE_ENABLE_VALUE	\
	(AW_PID_2055_HAGCE_ENABLE << AW_PID_2055_HAGCE_START_BIT)

#define AW_PID_2055_HAGCE_DEFAULT_VALUE	(0)
#define AW_PID_2055_HAGCE_DEFAULT		\
	(AW_PID_2055_HAGCE_DEFAULT_VALUE << AW_PID_2055_HAGCE_START_BIT)

/* HDCCE bit 9 (SYSCTRL 0x04) */
#define AW_PID_2055_HDCCE_START_BIT		(9)
#define AW_PID_2055_HDCCE_BITS_LEN		(1)
#define AW_PID_2055_HDCCE_MASK			\
	(~(((1<<AW_PID_2055_HDCCE_BITS_LEN)-1) << AW_PID_2055_HDCCE_START_BIT))

#define AW_PID_2055_HDCCE_DISABLE		(0)
#define AW_PID_2055_HDCCE_DISABLE_VALUE	\
	(AW_PID_2055_HDCCE_DISABLE << AW_PID_2055_HDCCE_START_BIT)

#define AW_PID_2055_HDCCE_ENABLE		(1)
#define AW_PID_2055_HDCCE_ENABLE_VALUE	\
	(AW_PID_2055_HDCCE_ENABLE << AW_PID_2055_HDCCE_START_BIT)

#define AW_PID_2055_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_2055_HDCCE_DEFAULT		\
	(AW_PID_2055_HDCCE_DEFAULT_VALUE << AW_PID_2055_HDCCE_START_BIT)

/* HMUTE bit 8 (SYSCTRL 0x04) */
#define AW_PID_2055_HMUTE_START_BIT		(8)
#define AW_PID_2055_HMUTE_BITS_LEN		(1)
#define AW_PID_2055_HMUTE_MASK			\
	(~(((1<<AW_PID_2055_HMUTE_BITS_LEN)-1) << AW_PID_2055_HMUTE_START_BIT))

#define AW_PID_2055_HMUTE_DISABLE		(0)
#define AW_PID_2055_HMUTE_DISABLE_VALUE	\
	(AW_PID_2055_HMUTE_DISABLE << AW_PID_2055_HMUTE_START_BIT)

#define AW_PID_2055_HMUTE_ENABLE		(1)
#define AW_PID_2055_HMUTE_ENABLE_VALUE	\
	(AW_PID_2055_HMUTE_ENABLE << AW_PID_2055_HMUTE_START_BIT)

#define AW_PID_2055_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_2055_HMUTE_DEFAULT		\
	(AW_PID_2055_HMUTE_DEFAULT_VALUE << AW_PID_2055_HMUTE_START_BIT)

/* RCV_MODE bit 7 (SYSCTRL 0x04) */
#define AW_PID_2055_RCV_MODE_START_BIT	(7)
#define AW_PID_2055_RCV_MODE_BITS_LEN	(1)
#define AW_PID_2055_RCV_MODE_MASK		\
	(~(((1<<AW_PID_2055_RCV_MODE_BITS_LEN)-1) << AW_PID_2055_RCV_MODE_START_BIT))

#define AW_PID_2055_RCV_MODE_SPEAKER	(0)
#define AW_PID_2055_RCV_MODE_SPEAKER_VALUE	\
	(AW_PID_2055_RCV_MODE_SPEAKER << AW_PID_2055_RCV_MODE_START_BIT)

#define AW_PID_2055_RCV_MODE_RECEIVER	(1)
#define AW_PID_2055_RCV_MODE_RECEIVER_VALUE	\
	(AW_PID_2055_RCV_MODE_RECEIVER << AW_PID_2055_RCV_MODE_START_BIT)

#define AW_PID_2055_RCV_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2055_RCV_MODE_DEFAULT	\
	(AW_PID_2055_RCV_MODE_DEFAULT_VALUE << AW_PID_2055_RCV_MODE_START_BIT)

/* ULS_MUTE bit 6 (SYSCTRL 0x04) */
#define AW_PID_2055_ULS_MUTE_START_BIT	(6)
#define AW_PID_2055_ULS_MUTE_BITS_LEN	(1)
#define AW_PID_2055_ULS_MUTE_MASK		\
	(~(((1<<AW_PID_2055_ULS_MUTE_BITS_LEN)-1) << AW_PID_2055_ULS_MUTE_START_BIT))

#define AW_PID_2055_ULS_MUTE_DISABLE	(0)
#define AW_PID_2055_ULS_MUTE_DISABLE_VALUE	\
	(AW_PID_2055_ULS_MUTE_DISABLE << AW_PID_2055_ULS_MUTE_START_BIT)

#define AW_PID_2055_ULS_MUTE_ENABLE		(1)
#define AW_PID_2055_ULS_MUTE_ENABLE_VALUE	\
	(AW_PID_2055_ULS_MUTE_ENABLE << AW_PID_2055_ULS_MUTE_START_BIT)

#define AW_PID_2055_ULS_MUTE_DEFAULT_VALUE	(1)
#define AW_PID_2055_ULS_MUTE_DEFAULT	\
	(AW_PID_2055_ULS_MUTE_DEFAULT_VALUE << AW_PID_2055_ULS_MUTE_START_BIT)

/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_2055_IPLL_START_BIT		(3)
#define AW_PID_2055_IPLL_BITS_LEN		(1)
#define AW_PID_2055_IPLL_MASK			\
	(~(((1<<AW_PID_2055_IPLL_BITS_LEN)-1) << AW_PID_2055_IPLL_START_BIT))

#define AW_PID_2055_IPLL_BCK			(0)
#define AW_PID_2055_IPLL_BCK_VALUE		\
	(AW_PID_2055_IPLL_BCK << AW_PID_2055_IPLL_START_BIT)

#define AW_PID_2055_IPLL_WCK			(1)
#define AW_PID_2055_IPLL_WCK_VALUE		\
	(AW_PID_2055_IPLL_WCK << AW_PID_2055_IPLL_START_BIT)

#define AW_PID_2055_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_2055_IPLL_DEFAULT		\
	(AW_PID_2055_IPLL_DEFAULT_VALUE << AW_PID_2055_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_2055_AMPPD_START_BIT		(1)
#define AW_PID_2055_AMPPD_BITS_LEN		(1)
#define AW_PID_2055_AMPPD_MASK			\
	(~(((1<<AW_PID_2055_AMPPD_BITS_LEN)-1) << AW_PID_2055_AMPPD_START_BIT))

#define AW_PID_2055_AMPPD_WORKING		(0)
#define AW_PID_2055_AMPPD_WORKING_VALUE	\
	(AW_PID_2055_AMPPD_WORKING << AW_PID_2055_AMPPD_START_BIT)

#define AW_PID_2055_AMPPD_POWER_DOWN	(1)
#define AW_PID_2055_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_2055_AMPPD_POWER_DOWN << AW_PID_2055_AMPPD_START_BIT)

#define AW_PID_2055_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_2055_AMPPD_DEFAULT		\
	(AW_PID_2055_AMPPD_DEFAULT_VALUE << AW_PID_2055_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_2055_PWDN_START_BIT		(0)
#define AW_PID_2055_PWDN_BITS_LEN		(1)
#define AW_PID_2055_PWDN_MASK			\
	(~(((1<<AW_PID_2055_PWDN_BITS_LEN)-1) << AW_PID_2055_PWDN_START_BIT))

#define AW_PID_2055_PWDN_WORKING		(0)
#define AW_PID_2055_PWDN_WORKING_VALUE	\
	(AW_PID_2055_PWDN_WORKING << AW_PID_2055_PWDN_START_BIT)

