LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_PWDN_POWER_DOWN		(1)
#define AW_PID_2055_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_2055_PWDN_POWER_DOWN << AW_PID_2055_PWDN_START_BIT)

#define AW_PID_2055_PWDN_DEFAULT_VALUE	(1)
#define AW_PID_2055_PWDN_DEFAULT		\
	(AW_PID_2055_PWDN_DEFAULT_VALUE << AW_PID_2055_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_2055_SYSCTRL_DEFAULT		(0x2343) */

/* SYSCTRL2 (0x05) detail */
/* INTMODE bit 13 (SYSCTRL2 0x05) */
#define AW_PID_2055_INTMODE_START_BIT	(13)
#define AW_PID_2055_INTMODE_BITS_LEN	(1)
#define AW_PID_2055_INTMODE_MASK		\
	(~(((1<<AW_PID_2055_INTMODE_BITS_LEN)-1) << AW_PID_2055_INTMODE_START_BIT))

#define AW_PID_2055_INTMODE_OPENMINUSDRAIN	(0)
#define AW_PID_2055_INTMODE_OPENMINUSDRAIN_VALUE	\
	(AW_PID_2055_INTMODE_OPENMINUSDRAIN << AW_PID_2055_INTMODE_START_BIT)

#define AW_PID_2055_INTMODE_PUSHPULL	(1)
#define AW_PID_2055_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_2055_INTMODE_PUSHPULL << AW_PID_2055_INTMODE_START_BIT)

#define AW_PID_2055_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_2055_INTMODE_DEFAULT		\
	(AW_PID_2055_INTMODE_DEFAULT_VALUE << AW_PID_2055_INTMODE_START_BIT)

/* INTN bit 12 (SYSCTRL2 0x05) */
#define AW_PID_2055_INTN_START_BIT		(12)
#define AW_PID_2055_INTN_BITS_LEN		(1)
#define AW_PID_2055_INTN_MASK			\
	(~(((1<<AW_PID_2055_INTN_BITS_LEN)-1) << AW_PID_2055_INTN_START_BIT))

#define AW_PID_2055_INTN_SYSINT			(0)
#define AW_PID_2055_INTN_SYSINT_VALUE	\
	(AW_PID_2055_INTN_SYSINT << AW_PID_2055_INTN_START_BIT)

#define AW_PID_2055_INTN_SYSST			(1)
#define AW_PID_2055_INTN_SYSST_VALUE	\
	(AW_PID_2055_INTN_SYSST << AW_PID_2055_INTN_START_BIT)

#define AW_PID_2055_INTN_DEFAULT_VALUE	(0)
#define AW_PID_2055_INTN_DEFAULT		\
	(AW_PID_2055_INTN_DEFAULT_VALUE << AW_PID_2055_INTN_START_BIT)

/* VOL bit 9:0 (SYSCTRL2 0x05) */
#define AW_PID_2055_VOL_START_BIT		(0)
#define AW_PID_2055_VOL_BITS_LEN		(10)
#define AW_PID_2055_VOL_MASK			\
	(~(((1<<AW_PID_2055_VOL_BITS_LEN)-1) << AW_PID_2055_VOL_START_BIT))

#define AW_PID_2055_VOL_DEFAULT_VALUE	(0)
#define AW_PID_2055_VOL_DEFAULT			\
	(AW_PID_2055_VOL_DEFAULT_VALUE << AW_PID_2055_VOL_START_BIT)

/* default value of SYSCTRL2 (0x05) */
/* #define AW_PID_2055_SYSCTRL2_DEFAULT		(0x0000) */

#define AW_PID_2055_MUTE_VOL	(90 * 8)
#define AW_PID_2055_VOL_STEP_DB	(6 * 8)

/* I2SCTRL1 (0x06) detail */
/* I2SRXEN bit 15 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SRXEN_START_BIT	(15)
#define AW_PID_2055_I2SRXEN_BITS_LEN	(1)
#define AW_PID_2055_I2SRXEN_MASK		\
	(~(((1<<AW_PID_2055_I2SRXEN_BITS_LEN)-1) << AW_PID_2055_I2SRXEN_START_BIT))

#define AW_PID_2055_I2SRXEN_DISABLE		(0)
#define AW_PID_2055_I2SRXEN_DISABLE_VALUE	\
	(AW_PID_2055_I2SRXEN_DISABLE << AW_PID_2055_I2SRXEN_START_BIT)

#define AW_PID_2055_I2SRXEN_ENABLE		(1)
#define AW_PID_2055_I2SRXEN_ENABLE_VALUE	\
	(AW_PID_2055_I2SRXEN_ENABLE << AW_PID_2055_I2SRXEN_START_BIT)

#define AW_PID_2055_I2SRXEN_DEFAULT_VALUE	(1)
#define AW_PID_2055_I2SRXEN_DEFAULT		\
	(AW_PID_2055_I2SRXEN_DEFAULT_VALUE << AW_PID_2055_I2SRXEN_START_BIT)

/* I2STXEN bit 14 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2STXEN_START_BIT	(14)
#define AW_PID_2055_I2STXEN_BITS_LEN	(1)
#define AW_PID_2055_I2STXEN_MASK		\
	(~(((1<<AW_PID_2055_I2STXEN_BITS_LEN)-1) << AW_PID_2055_I2STXEN_START_BIT))

#define AW_PID_2055_I2STXEN_DISABLE		(0)
#define AW_PID_2055_I2STXEN_DISABLE_VALUE	\
	(AW_PID_2055_I2STXEN_DISABLE << AW_PID_2055_I2STXEN_START_BIT)

#define AW_PID_2055_I2STXEN_ENABLE		(1)
#define AW_PID_2055_I2STXEN_ENABLE_VALUE	\
	(AW_PID_2055_I2STXEN_ENABLE << AW_PID_2055_I2STXEN_START_BIT)

#define AW_PID_2055_I2STXEN_DEFAULT_VALUE	(0)
#define AW_PID_2055_I2STXEN_DEFAULT		\
	(AW_PID_2055_I2STXEN_DEFAULT_VALUE << AW_PID_2055_I2STXEN_START_BIT)

/* I2SEN bit 13 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SEN_START_BIT		(13)
#define AW_PID_2055_I2SEN_BITS_LEN		(1)
#define AW_PID_2055_I2SEN_MASK			\
	(~(((1<<AW_PID_2055_I2SEN_BITS_LEN)-1) << AW_PID_2055_I2SEN_START_BIT))

#define AW_PID_2055_I2SEN_DISABLE		(0)
#define AW_PID_2055_I2SEN_DISABLE_VALUE	\
	(AW_PID_2055_I2SEN_DISABLE << AW_PID_2055_I2SEN_START_BIT)

#define AW_PID_2055_I2SEN_ENABLE		(1)
#define AW_PID_2055_I2SEN_ENABLE_VALUE	\
	(AW_PID_2055_I2SEN_ENABLE << AW_PID_2055_I2SEN_START_BIT)

#define AW_PID_2055_I2SEN_DEFAULT_VALUE	(0)
#define AW_PID_2055_I2SEN_DEFAULT		\
	(AW_PID_2055_I2SEN_DEFAULT_VALUE << AW_PID_2055_I2SEN_START_BIT)

/* DRVSTREN bit 12 (I2SCTRL1 0x06) */
#define AW_PID_2055_DRVSTREN_START_BIT	(12)
#define AW_PID_2055_DRVSTREN_BITS_LEN	(1)
#define AW_PID_2055_DRVSTREN_MASK		\
	(~(((1<<AW_PID_2055_DRVSTREN_BITS_LEN)-1) << AW_PID_2055_DRVSTREN_START_BIT))

#define AW_PID_2055_DRVSTREN_4MA		(0)
#define AW_PID_2055_DRVSTREN_4MA_VALUE	\
	(AW_PID_2055_DRVSTREN_4MA << AW_PID_2055_DRVSTREN_START_BIT)

#define AW_PID_2055_DRVSTREN_12MA		(1)
#define AW_PID_2055_DRVSTREN_12MA_VALUE	\
	(AW_PID_2055_DRVSTREN_12MA << AW_PID_2055_DRVSTREN_START_BIT)

#define AW_PID_2055_DRVSTREN_DEFAULT_VALUE	(1)
#define AW_PID_2055_DRVSTREN_DEFAULT	\
	(AW_PID_2055_DRVSTREN_DEFAULT_VALUE << AW_PID_2055_DRVSTREN_START_BIT)

/* CHSEL bit 11:10 (I2SCTRL1 0x06) */
#define AW_PID_2055_CHSEL_START_BIT		(10)
#define AW_PID_2055_CHSEL_BITS_LEN		(2)
#define AW_PID_2055_CHSEL_MASK			\
	(~(((1<<AW_PID_2055_CHSEL_BITS_LEN)-1) << AW_PID_2055_CHSEL_START_BIT))

#define AW_PID_2055_CHSEL_RESERVED		(0)
#define AW_PID_2055_CHSEL_RESERVED_VALUE	\
	(AW_PID_2055_CHSEL_RESERVED << AW_PID_2055_CHSEL_START_BIT)

#define AW_PID_2055_CHSEL_LEFT			(1)
#define AW_PID_2055_CHSEL_LEFT_VALUE	\
	(AW_PID_2055_CHSEL_LEFT << AW_PID_2055_CHSEL_START_BIT)

#define AW_PID_2055_CHSEL_RIGHT			(2)
#define AW_PID_2055_CHSEL_RIGHT_VALUE	\
	(AW_PID_2055_CHSEL_RIGHT << AW_PID_2055_CHSEL_START_BIT)

#define AW_PID_2055_CHSEL_MONO			(3)
#define AW_PID_2055_CHSEL_MONO_VALUE	\
	(AW_PID_2055_CHSEL_MONO << AW_PID_2055_CHSEL_START_BIT)

#define AW_PID_2055_CHSEL_DEFAULT_VALUE	(1)
#define AW_PID_2055_CHSEL_DEFAULT		\
	(AW_PID_2055_CHSEL_DEFAULT_VALUE << AW_PID_2055_CHSEL_START_BIT)

/* I2SMD bit 9:8 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SMD_START_BIT		(8)
#define AW_PID_2055_I2SMD_BITS_LEN		(2)
#define AW_PID_2055_I2SMD_MASK			\
	(~(((1<<AW_PID_2055_I2SMD_BITS_LEN)-1) << AW_PID_2055_I2SMD_START_BIT))

