LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_I2SMD_PHILIP_STANDARD	(0)
#define AW_PID_2055_I2SMD_PHILIP_STANDARD_VALUE	\
	(AW_PID_2055_I2SMD_PHILIP_STANDARD << AW_PID_2055_I2SMD_START_BIT)

#define AW_PID_2055_I2SMD_MSB_JUSTIFIED	(1)
#define AW_PID_2055_I2SMD_MSB_JUSTIFIED_VALUE	\
	(AW_PID_2055_I2SMD_MSB_JUSTIFIED << AW_PID_2055_I2SMD_START_BIT)

#define AW_PID_2055_I2SMD_LSB_JUSTIFIED	(2)
#define AW_PID_2055_I2SMD_LSB_JUSTIFIED_VALUE	\
	(AW_PID_2055_I2SMD_LSB_JUSTIFIED << AW_PID_2055_I2SMD_START_BIT)

#define AW_PID_2055_I2SMD_RESERVED		(3)
#define AW_PID_2055_I2SMD_RESERVED_VALUE	\
	(AW_PID_2055_I2SMD_RESERVED << AW_PID_2055_I2SMD_START_BIT)

#define AW_PID_2055_I2SMD_DEFAULT_VALUE	(0)
#define AW_PID_2055_I2SMD_DEFAULT		\
	(AW_PID_2055_I2SMD_DEFAULT_VALUE << AW_PID_2055_I2SMD_START_BIT)

/* I2SFS bit 7:6 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SFS_START_BIT		(6)
#define AW_PID_2055_I2SFS_BITS_LEN		(2)
#define AW_PID_2055_I2SFS_MASK			\
	(~(((1<<AW_PID_2055_I2SFS_BITS_LEN)-1) << AW_PID_2055_I2SFS_START_BIT))

#define AW_PID_2055_I2SFS_16_BITS		(0)
#define AW_PID_2055_I2SFS_16_BITS_VALUE	\
	(AW_PID_2055_I2SFS_16_BITS << AW_PID_2055_I2SFS_START_BIT)

#define AW_PID_2055_I2SFS_20_BITS		(1)
#define AW_PID_2055_I2SFS_20_BITS_VALUE	\
	(AW_PID_2055_I2SFS_20_BITS << AW_PID_2055_I2SFS_START_BIT)

#define AW_PID_2055_I2SFS_24_BITS		(2)
#define AW_PID_2055_I2SFS_24_BITS_VALUE	\
	(AW_PID_2055_I2SFS_24_BITS << AW_PID_2055_I2SFS_START_BIT)

#define AW_PID_2055_I2SFS_32_BITS		(3)
#define AW_PID_2055_I2SFS_32_BITS_VALUE	\
	(AW_PID_2055_I2SFS_32_BITS << AW_PID_2055_I2SFS_START_BIT)

#define AW_PID_2055_I2SFS_DEFAULT_VALUE	(3)
#define AW_PID_2055_I2SFS_DEFAULT		\
	(AW_PID_2055_I2SFS_DEFAULT_VALUE << AW_PID_2055_I2SFS_START_BIT)

/* I2SBCK bit 5:4 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SBCK_START_BIT	(4)
#define AW_PID_2055_I2SBCK_BITS_LEN		(2)
#define AW_PID_2055_I2SBCK_MASK			\
	(~(((1<<AW_PID_2055_I2SBCK_BITS_LEN)-1) << AW_PID_2055_I2SBCK_START_BIT))

#define AW_PID_2055_I2SBCK_32FS			(0)
#define AW_PID_2055_I2SBCK_32FS_VALUE	\
	(AW_PID_2055_I2SBCK_32FS << AW_PID_2055_I2SBCK_START_BIT)

#define AW_PID_2055_I2SBCK_48FS			(1)
#define AW_PID_2055_I2SBCK_48FS_VALUE	\
	(AW_PID_2055_I2SBCK_48FS << AW_PID_2055_I2SBCK_START_BIT)

#define AW_PID_2055_I2SBCK_64FS			(2)
#define AW_PID_2055_I2SBCK_64FS_VALUE	\
	(AW_PID_2055_I2SBCK_64FS << AW_PID_2055_I2SBCK_START_BIT)

#define AW_PID_2055_I2SBCK_RESERVED		(3)
#define AW_PID_2055_I2SBCK_RESERVED_VALUE	\
	(AW_PID_2055_I2SBCK_RESERVED << AW_PID_2055_I2SBCK_START_BIT)

#define AW_PID_2055_I2SBCK_DEFAULT_VALUE	(2)
#define AW_PID_2055_I2SBCK_DEFAULT		\
	(AW_PID_2055_I2SBCK_DEFAULT_VALUE << AW_PID_2055_I2SBCK_START_BIT)

/* I2SSR bit 3:0 (I2SCTRL1 0x06) */
#define AW_PID_2055_I2SSR_START_BIT		(0)
#define AW_PID_2055_I2SSR_BITS_LEN		(4)
#define AW_PID_2055_I2SSR_MASK			\
	(~(((1<<AW_PID_2055_I2SSR_BITS_LEN)-1) << AW_PID_2055_I2SSR_START_BIT))

#define AW_PID_2055_I2SSR_8_KHZ			(0)
#define AW_PID_2055_I2SSR_8_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_8_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_11_KHZ		(1)
#define AW_PID_2055_I2SSR_11_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_11_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_12_KHZ		(2)
#define AW_PID_2055_I2SSR_12_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_12_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_16_KHZ		(3)
#define AW_PID_2055_I2SSR_16_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_16_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_22_KHZ		(4)
#define AW_PID_2055_I2SSR_22_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_22_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_24_KHZ		(5)
#define AW_PID_2055_I2SSR_24_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_24_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_32_KHZ		(6)
#define AW_PID_2055_I2SSR_32_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_32_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_44_KHZ		(7)
#define AW_PID_2055_I2SSR_44_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_44_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_48_KHZ		(8)
#define AW_PID_2055_I2SSR_48_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_48_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_96_KHZ		(9)
#define AW_PID_2055_I2SSR_96_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_96_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_192_KHZ		(10)
#define AW_PID_2055_I2SSR_192_KHZ_VALUE	\
	(AW_PID_2055_I2SSR_192_KHZ << AW_PID_2055_I2SSR_START_BIT)

#define AW_PID_2055_I2SSR_DEFAULT_VALUE	(8)
#define AW_PID_2055_I2SSR_DEFAULT		\
	(AW_PID_2055_I2SSR_DEFAULT_VALUE << AW_PID_2055_I2SSR_START_BIT)

/* default value of I2SCTRL1 (0x06) */
/* #define AW_PID_2055_I2SCTRL1_DEFAULT		(0x94E8) */

/* I2SCTRL2 (0x07) detail */
/* FSYNC_TYPE bit 15 (I2SCTRL2 0x07) */
#define AW_PID_2055_FSYNC_TYPE_START_BIT	(15)
#define AW_PID_2055_FSYNC_TYPE_BITS_LEN	(1)
#define AW_PID_2055_FSYNC_TYPE_MASK		\
	(~(((1<<AW_PID_2055_FSYNC_TYPE_BITS_LEN)-1) << AW_PID_2055_FSYNC_TYPE_START_BIT))

#define AW_PID_2055_FSYNC_TYPE_ONEMINUSSLOT	(0)
#define AW_PID_2055_FSYNC_TYPE_ONEMINUSSLOT_VALUE	\
	(AW_PID_2055_FSYNC_TYPE_ONEMINUSSLOT << AW_PID_2055_FSYNC_TYPE_START_BIT)

#define AW_PID_2055_FSYNC_TYPE_ONEMINUSBCK	(1)
#define AW_PID_2055_FSYNC_TYPE_ONEMINUSBCK_VALUE	\
	(AW_PID_2055_FSYNC_TYPE_ONEMINUSBCK << AW_PID_2055_FSYNC_TYPE_START_BIT)

#define AW_PID_2055_FSYNC_TYPE_DEFAULT_VALUE	(0)
#define AW_PID_2055_FSYNC_TYPE_DEFAULT	\
	(AW_PID_2055_FSYNC_TYPE_DEFAULT_VALUE << AW_PID_2055_FSYNC_TYPE_START_BIT)

/* SLOT_NUM bit 14:12 (I2SCTRL2 0x07) */
#define AW_PID_2055_SLOT_NUM_START_BIT	(12)
#define AW_PID_2055_SLOT_NUM_BITS_LEN	(3)
#define AW_PID_2055_SLOT_NUM_MASK		\
	(~(((1<<AW_PID_2055_SLOT_NUM_BITS_LEN)-1) << AW_PID_2055_SLOT_NUM_START_BIT))

#define AW_PID_2055_SLOT_NUM_I2S_MODE	(0)
#define AW_PID_2055_SLOT_NUM_I2S_MODE_VALUE	\
	(AW_PID_2055_SLOT_NUM_I2S_MODE << AW_PID_2055_SLOT_NUM_START_BIT)

