LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_4	(4)
#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_4 << AW_PID_2055_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_5	(5)
#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_5 << AW_PID_2055_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_6	(6)
#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_6 << AW_PID_2055_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_15	(15)
#define AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_15_VALUE	\
	(AW_PID_2055_I2S_RXL_SLOTVLD_SLOT_15 << AW_PID_2055_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2055_I2S_RXL_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2055_I2S_RXL_SLOTVLD_DEFAULT	\
	(AW_PID_2055_I2S_RXL_SLOTVLD_DEFAULT_VALUE << AW_PID_2055_I2S_RXL_SLOTVLD_START_BIT)

/* default value of I2SCTRL2 (0x07) */
/* #define AW_PID_2055_I2SCTRL2_DEFAULT		(0x0010) */

/* I2SCTRL3 (0x08) detail */
/* IV2CH bit 9 (I2SCTRL3 0x08) */
#define AW_PID_2055_IV2CH_START_BIT		(9)
#define AW_PID_2055_IV2CH_BITS_LEN		(1)
#define AW_PID_2055_IV2CH_MASK			\
	(~(((1<<AW_PID_2055_IV2CH_BITS_LEN)-1) << AW_PID_2055_IV2CH_START_BIT))

#define AW_PID_2055_IV2CH_LEGACY		(0)
#define AW_PID_2055_IV2CH_LEGACY_VALUE	\
	(AW_PID_2055_IV2CH_LEGACY << AW_PID_2055_IV2CH_START_BIT)

#define AW_PID_2055_IV2CH_SPECIAL		(1)
#define AW_PID_2055_IV2CH_SPECIAL_VALUE	\
	(AW_PID_2055_IV2CH_SPECIAL << AW_PID_2055_IV2CH_START_BIT)

#define AW_PID_2055_IV2CH_DEFAULT_VALUE	(0)
#define AW_PID_2055_IV2CH_DEFAULT		\
	(AW_PID_2055_IV2CH_DEFAULT_VALUE << AW_PID_2055_IV2CH_START_BIT)

/* WSINV bit 8 (I2SCTRL3 0x08) */
#define AW_PID_2055_WSINV_START_BIT		(8)
#define AW_PID_2055_WSINV_BITS_LEN		(1)
#define AW_PID_2055_WSINV_MASK			\
	(~(((1<<AW_PID_2055_WSINV_BITS_LEN)-1) << AW_PID_2055_WSINV_START_BIT))

#define AW_PID_2055_WSINV_NOT_SWITCH	(0)
#define AW_PID_2055_WSINV_NOT_SWITCH_VALUE	\
	(AW_PID_2055_WSINV_NOT_SWITCH << AW_PID_2055_WSINV_START_BIT)

#define AW_PID_2055_WSINV_SWITCH		(1)
#define AW_PID_2055_WSINV_SWITCH_VALUE	\
	(AW_PID_2055_WSINV_SWITCH << AW_PID_2055_WSINV_START_BIT)

#define AW_PID_2055_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_2055_WSINV_DEFAULT		\
	(AW_PID_2055_WSINV_DEFAULT_VALUE << AW_PID_2055_WSINV_START_BIT)

/* BCKINV bit 7 (I2SCTRL3 0x08) */
#define AW_PID_2055_BCKINV_START_BIT	(7)
#define AW_PID_2055_BCKINV_BITS_LEN		(1)
#define AW_PID_2055_BCKINV_MASK			\
	(~(((1<<AW_PID_2055_BCKINV_BITS_LEN)-1) << AW_PID_2055_BCKINV_START_BIT))

#define AW_PID_2055_BCKINV_NOT_INVERT	(0)
#define AW_PID_2055_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_2055_BCKINV_NOT_INVERT << AW_PID_2055_BCKINV_START_BIT)

#define AW_PID_2055_BCKINV_INVERTED		(1)
#define AW_PID_2055_BCKINV_INVERTED_VALUE	\
	(AW_PID_2055_BCKINV_INVERTED << AW_PID_2055_BCKINV_START_BIT)

#define AW_PID_2055_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_2055_BCKINV_DEFAULT		\
	(AW_PID_2055_BCKINV_DEFAULT_VALUE << AW_PID_2055_BCKINV_START_BIT)

/* I2SDOSEL bit 6 (I2SCTRL3 0x08) */
#define AW_PID_2055_I2SDOSEL_START_BIT	(6)
#define AW_PID_2055_I2SDOSEL_BITS_LEN	(1)
#define AW_PID_2055_I2SDOSEL_MASK		\
	(~(((1<<AW_PID_2055_I2SDOSEL_BITS_LEN)-1) << AW_PID_2055_I2SDOSEL_START_BIT))

#define AW_PID_2055_I2SDOSEL_ZEROS		(0)
#define AW_PID_2055_I2SDOSEL_ZEROS_VALUE	\
	(AW_PID_2055_I2SDOSEL_ZEROS << AW_PID_2055_I2SDOSEL_START_BIT)

#define AW_PID_2055_I2SDOSEL_TXDATA		(1)
#define AW_PID_2055_I2SDOSEL_TXDATA_VALUE	\
	(AW_PID_2055_I2SDOSEL_TXDATA << AW_PID_2055_I2SDOSEL_START_BIT)

#define AW_PID_2055_I2SDOSEL_DEFAULT_VALUE	(1)
#define AW_PID_2055_I2SDOSEL_DEFAULT	\
	(AW_PID_2055_I2SDOSEL_DEFAULT_VALUE << AW_PID_2055_I2SDOSEL_START_BIT)

/* DOHZ bit 5 (I2SCTRL3 0x08) */
#define AW_PID_2055_DOHZ_START_BIT		(5)
#define AW_PID_2055_DOHZ_BITS_LEN		(1)
#define AW_PID_2055_DOHZ_MASK			\
	(~(((1<<AW_PID_2055_DOHZ_BITS_LEN)-1) << AW_PID_2055_DOHZ_START_BIT))

#define AW_PID_2055_DOHZ_ALL			(0)
#define AW_PID_2055_DOHZ_ALL_VALUE		\
	(AW_PID_2055_DOHZ_ALL << AW_PID_2055_DOHZ_START_BIT)

#define AW_PID_2055_DOHZ_HIZ			(1)
#define AW_PID_2055_DOHZ_HIZ_VALUE		\
	(AW_PID_2055_DOHZ_HIZ << AW_PID_2055_DOHZ_START_BIT)

#define AW_PID_2055_DOHZ_DEFAULT_VALUE	(1)
#define AW_PID_2055_DOHZ_DEFAULT		\
	(AW_PID_2055_DOHZ_DEFAULT_VALUE << AW_PID_2055_DOHZ_START_BIT)

/* I2SCHS bit 4 (I2SCTRL3 0x08) */
#define AW_PID_2055_I2SCHS_START_BIT	(4)
#define AW_PID_2055_I2SCHS_BITS_LEN		(1)
#define AW_PID_2055_I2SCHS_MASK			\
	(~(((1<<AW_PID_2055_I2SCHS_BITS_LEN)-1) << AW_PID_2055_I2SCHS_START_BIT))

#define AW_PID_2055_I2SCHS_LEFT			(0)
#define AW_PID_2055_I2SCHS_LEFT_VALUE	\
	(AW_PID_2055_I2SCHS_LEFT << AW_PID_2055_I2SCHS_START_BIT)

#define AW_PID_2055_I2SCHS_RIGHT		(1)
#define AW_PID_2055_I2SCHS_RIGHT_VALUE	\
	(AW_PID_2055_I2SCHS_RIGHT << AW_PID_2055_I2SCHS_START_BIT)

#define AW_PID_2055_I2SCHS_DEFAULT_VALUE	(0)
#define AW_PID_2055_I2SCHS_DEFAULT		\
	(AW_PID_2055_I2SCHS_DEFAULT_VALUE << AW_PID_2055_I2SCHS_START_BIT)

/* CFSEL bit 2:0 (I2SCTRL3 0x08) */
#define AW_PID_2055_CFSEL_START_BIT		(0)
#define AW_PID_2055_CFSEL_BITS_LEN		(3)
#define AW_PID_2055_CFSEL_MASK			\
	(~(((1<<AW_PID_2055_CFSEL_BITS_LEN)-1) << AW_PID_2055_CFSEL_START_BIT))

#define AW_PID_2055_CFSEL_HAGC			(0)
#define AW_PID_2055_CFSEL_HAGC_VALUE	\
	(AW_PID_2055_CFSEL_HAGC << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_ULSLP			(1)
#define AW_PID_2055_CFSEL_ULSLP_VALUE	\
	(AW_PID_2055_CFSEL_ULSLP << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_INTP_DOUT		(2)
#define AW_PID_2055_CFSEL_INTP_DOUT_VALUE	\
	(AW_PID_2055_CFSEL_INTP_DOUT << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_ORTESTDET		(3)
#define AW_PID_2055_CFSEL_ORTESTDET_VALUE	\
	(AW_PID_2055_CFSEL_ORTESTDET << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_IVBTTXDOUT	(4)
#define AW_PID_2055_CFSEL_IVBTTXDOUT_VALUE	\
	(AW_PID_2055_CFSEL_IVBTTXDOUT << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_VBTTXDOUT		(5)
#define AW_PID_2055_CFSEL_VBTTXDOUT_VALUE	\
	(AW_PID_2055_CFSEL_VBTTXDOUT << AW_PID_2055_CFSEL_START_BIT)

#define AW_PID_2055_CFSEL_DEFAULT_VALUE	(0)
#define AW_PID_2055_CFSEL_DEFAULT		\
	(AW_PID_2055_CFSEL_DEFAULT_VALUE << AW_PID_2055_CFSEL_START_BIT)

