LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
/* default value of I2SCTRL3 (0x08) */
/* #define AW_PID_2055_I2SCTRL3_DEFAULT		(0x0060) */

/* DACCFG1 (0x09) detail */
/* RVTH bit 15:8 (DACCFG1 0x09) */
#define AW_PID_2055_RVTH_START_BIT		(8)
#define AW_PID_2055_RVTH_BITS_LEN		(8)
#define AW_PID_2055_RVTH_MASK			\
	(~(((1<<AW_PID_2055_RVTH_BITS_LEN)-1) << AW_PID_2055_RVTH_START_BIT))

#define AW_PID_2055_RVTH_DEFAULT_VALUE	(0x39)
#define AW_PID_2055_RVTH_DEFAULT		\
	(AW_PID_2055_RVTH_DEFAULT_VALUE << AW_PID_2055_RVTH_START_BIT)

/* AVTH bit 7:0 (DACCFG1 0x09) */
#define AW_PID_2055_AVTH_START_BIT		(0)
#define AW_PID_2055_AVTH_BITS_LEN		(8)
#define AW_PID_2055_AVTH_MASK			\
	(~(((1<<AW_PID_2055_AVTH_BITS_LEN)-1) << AW_PID_2055_AVTH_START_BIT))

#define AW_PID_2055_AVTH_DEFAULT_VALUE	(0x40)
#define AW_PID_2055_AVTH_DEFAULT		\
	(AW_PID_2055_AVTH_DEFAULT_VALUE << AW_PID_2055_AVTH_START_BIT)

/* default value of DACCFG1 (0x09) */
/* #define AW_PID_2055_DACCFG1_DEFAULT		(0x3940) */

/* DACCFG2 (0x0A) detail */
/* ATTH bit 15:0 (DACCFG2 0x0A) */
#define AW_PID_2055_ATTH_START_BIT		(0)
#define AW_PID_2055_ATTH_BITS_LEN		(16)
#define AW_PID_2055_ATTH_MASK			\
	(~(((1<<AW_PID_2055_ATTH_BITS_LEN)-1) << AW_PID_2055_ATTH_START_BIT))

#define AW_PID_2055_ATTH_RESERVED		(0)
#define AW_PID_2055_ATTH_RESERVED_VALUE	\
	(AW_PID_2055_ATTH_RESERVED << AW_PID_2055_ATTH_START_BIT)

#define AW_PID_2055_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_2055_ATTH_DEFAULT		\
	(AW_PID_2055_ATTH_DEFAULT_VALUE << AW_PID_2055_ATTH_START_BIT)

/* default value of DACCFG2 (0x0A) */
/* #define AW_PID_2055_DACCFG2_DEFAULT		(0x0030) */

/* DACCFG3 (0x0B) detail */
/* RTTH bit 15:0 (DACCFG3 0x0B) */
#define AW_PID_2055_RTTH_START_BIT		(0)
#define AW_PID_2055_RTTH_BITS_LEN		(16)
#define AW_PID_2055_RTTH_MASK			\
	(~(((1<<AW_PID_2055_RTTH_BITS_LEN)-1) << AW_PID_2055_RTTH_START_BIT))

#define AW_PID_2055_RTTH_RESERVED		(0)
#define AW_PID_2055_RTTH_RESERVED_VALUE	\
	(AW_PID_2055_RTTH_RESERVED << AW_PID_2055_RTTH_START_BIT)

#define AW_PID_2055_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_2055_RTTH_DEFAULT		\
	(AW_PID_2055_RTTH_DEFAULT_VALUE << AW_PID_2055_RTTH_START_BIT)

/* default value of DACCFG3 (0x0B) */
/* #define AW_PID_2055_DACCFG3_DEFAULT		(0x01E0) */

/* DACCFG4 (0x0C) detail */
/* IIC_GEN_ADDR bit 15:9 (DACCFG4 0x0C) */
#define AW_PID_2055_IIC_GEN_ADDR_START_BIT	(9)
#define AW_PID_2055_IIC_GEN_ADDR_BITS_LEN	(7)
#define AW_PID_2055_IIC_GEN_ADDR_MASK	\
	(~(((1<<AW_PID_2055_IIC_GEN_ADDR_BITS_LEN)-1) << AW_PID_2055_IIC_GEN_ADDR_START_BIT))

#define AW_PID_2055_IIC_GEN_ADDR_DEFAULT_VALUE	(0x0E)
#define AW_PID_2055_IIC_GEN_ADDR_DEFAULT	\
	(AW_PID_2055_IIC_GEN_ADDR_DEFAULT_VALUE << AW_PID_2055_IIC_GEN_ADDR_START_BIT)

/* IIC_GEN_EN bit 8 (DACCFG4 0x0C) */
#define AW_PID_2055_IIC_GEN_EN_START_BIT	(8)
#define AW_PID_2055_IIC_GEN_EN_BITS_LEN	(1)
#define AW_PID_2055_IIC_GEN_EN_MASK		\
	(~(((1<<AW_PID_2055_IIC_GEN_EN_BITS_LEN)-1) << AW_PID_2055_IIC_GEN_EN_START_BIT))

#define AW_PID_2055_IIC_GEN_EN_DISABLE	(0)
#define AW_PID_2055_IIC_GEN_EN_DISABLE_VALUE	\
	(AW_PID_2055_IIC_GEN_EN_DISABLE << AW_PID_2055_IIC_GEN_EN_START_BIT)

#define AW_PID_2055_IIC_GEN_EN_ENABLE	(1)
#define AW_PID_2055_IIC_GEN_EN_ENABLE_VALUE	\
	(AW_PID_2055_IIC_GEN_EN_ENABLE << AW_PID_2055_IIC_GEN_EN_START_BIT)

#define AW_PID_2055_IIC_GEN_EN_DEFAULT_VALUE	(0)
#define AW_PID_2055_IIC_GEN_EN_DEFAULT	\
	(AW_PID_2055_IIC_GEN_EN_DEFAULT_VALUE << AW_PID_2055_IIC_GEN_EN_START_BIT)

/* HOLDTH bit 7:0 (DACCFG4 0x0C) */
#define AW_PID_2055_HOLDTH_START_BIT	(0)
#define AW_PID_2055_HOLDTH_BITS_LEN		(8)
#define AW_PID_2055_HOLDTH_MASK			\
	(~(((1<<AW_PID_2055_HOLDTH_BITS_LEN)-1) << AW_PID_2055_HOLDTH_START_BIT))

#define AW_PID_2055_HOLDTH_RESERVED		(0)
#define AW_PID_2055_HOLDTH_RESERVED_VALUE	\
	(AW_PID_2055_HOLDTH_RESERVED << AW_PID_2055_HOLDTH_START_BIT)

#define AW_PID_2055_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_2055_HOLDTH_DEFAULT		\
	(AW_PID_2055_HOLDTH_DEFAULT_VALUE << AW_PID_2055_HOLDTH_START_BIT)

/* default value of DACCFG4 (0x0C) */
/* #define AW_PID_2055_DACCFG4_DEFAULT		(0x1C64) */

/* VBAT (0x21) detail */
/* VBAT_DET bit 9:0 (VBAT 0x21) */
#define AW_PID_2055_VBAT_DET_START_BIT	(0)
#define AW_PID_2055_VBAT_DET_BITS_LEN	(10)
#define AW_PID_2055_VBAT_DET_MASK		\
	(~(((1<<AW_PID_2055_VBAT_DET_BITS_LEN)-1) << AW_PID_2055_VBAT_DET_START_BIT))

#define AW_PID_2055_VBAT_DET_DEFAULT_VALUE	(0x2a0)
#define AW_PID_2055_VBAT_DET_DEFAULT	\
	(AW_PID_2055_VBAT_DET_DEFAULT_VALUE << AW_PID_2055_VBAT_DET_START_BIT)

/* default value of VBAT (0x21) */
/* #define AW_PID_2055_VBAT_DEFAULT		(0x02A0) */

/* TEMP (0x22) detail */
/* TEMP_DET bit 9:0 (TEMP 0x22) */
#define AW_PID_2055_TEMP_DET_START_BIT	(0)
#define AW_PID_2055_TEMP_DET_BITS_LEN	(10)
#define AW_PID_2055_TEMP_DET_MASK		\
	(~(((1<<AW_PID_2055_TEMP_DET_BITS_LEN)-1) << AW_PID_2055_TEMP_DET_START_BIT))

#define AW_PID_2055_TEMP_DET_MINUS40	(0x3D8)
#define AW_PID_2055_TEMP_DET_MINUS40_VALUE	\
	(AW_PID_2055_TEMP_DET_MINUS40 << AW_PID_2055_TEMP_DET_START_BIT)

#define AW_PID_2055_TEMP_DET_0			(0x00)
#define AW_PID_2055_TEMP_DET_0_VALUE	\
	(AW_PID_2055_TEMP_DET_0 << AW_PID_2055_TEMP_DET_START_BIT)

#define AW_PID_2055_TEMP_DET_1			(0x01)
#define AW_PID_2055_TEMP_DET_1_VALUE	\
	(AW_PID_2055_TEMP_DET_1 << AW_PID_2055_TEMP_DET_START_BIT)

#define AW_PID_2055_TEMP_DET_25			(0x19)
#define AW_PID_2055_TEMP_DET_25_VALUE	\
	(AW_PID_2055_TEMP_DET_25 << AW_PID_2055_TEMP_DET_START_BIT)

#define AW_PID_2055_TEMP_DET_55			(0x37)
#define AW_PID_2055_TEMP_DET_55_VALUE	\
	(AW_PID_2055_TEMP_DET_55 << AW_PID_2055_TEMP_DET_START_BIT)

#define AW_PID_2055_TEMP_DET_DEFAULT_VALUE	(0x019)
#define AW_PID_2055_TEMP_DET_DEFAULT	\
	(AW_PID_2055_TEMP_DET_DEFAULT_VALUE << AW_PID_2055_TEMP_DET_START_BIT)

/* default value of TEMP (0x22) */
/* #define AW_PID_2055_TEMP_DEFAULT		(0x0019) */

/* PVDD (0x23) detail */
/* PVDD_DET bit 9:0 (PVDD 0x23) */
#define AW_PID_2055_PVDD_DET_START_BIT	(0)
#define AW_PID_2055_PVDD_DET_BITS_LEN	(10)
#define AW_PID_2055_PVDD_DET_MASK		\
	(~(((1<<AW_PID_2055_PVDD_DET_BITS_LEN)-1) << AW_PID_2055_PVDD_DET_START_BIT))

#define AW_PID_2055_PVDD_DET_DEFAULT_VALUE	(0x2a0)
#define AW_PID_2055_PVDD_DET_DEFAULT	\
	(AW_PID_2055_PVDD_DET_DEFAULT_VALUE << AW_PID_2055_PVDD_DET_START_BIT)

