LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
/* default value of PVDD (0x23) */
/* #define AW_PID_2055_PVDD_DEFAULT		(0x02A0) */

/* CCO_MUX bit 2 (PLLCTRL3 0x52) */
#define AW_PID_2055_CCO_MUX_START_BIT	(2)
#define AW_PID_2055_CCO_MUX_BITS_LEN	(1)
#define AW_PID_2055_CCO_MUX_MASK		\
	(~(((1<<AW_PID_2055_CCO_MUX_BITS_LEN)-1) << AW_PID_2055_CCO_MUX_START_BIT))

#define AW_PID_2055_CCO_MUX_DIVIDED		(0)
#define AW_PID_2055_CCO_MUX_DIVIDED_VALUE	\
	(AW_PID_2055_CCO_MUX_DIVIDED << AW_PID_2055_CCO_MUX_START_BIT)

#define AW_PID_2055_CCO_MUX_BYPASS		(1)
#define AW_PID_2055_CCO_MUX_BYPASS_VALUE	\
	(AW_PID_2055_CCO_MUX_BYPASS << AW_PID_2055_CCO_MUX_START_BIT)

/* BOP_EN bit 4 (SADCCTRL3 0x3C) */
#define AW_PID_2055_BOP_EN_START_BIT	(4)
#define AW_PID_2055_BOP_EN_BITS_LEN		(1)
#define AW_PID_2055_BOP_EN_MASK			\
	(~(((1<<AW_PID_2055_BOP_EN_BITS_LEN)-1) << AW_PID_2055_BOP_EN_START_BIT))

#define AW_PID_2055_BOP_EN_DISABLE		(0)
#define AW_PID_2055_BOP_EN_DISABLE_VALUE	\
	(AW_PID_2055_BOP_EN_DISABLE << AW_PID_2055_BOP_EN_START_BIT)

#define AW_PID_2055_BOP_EN_ENABLE		(1)
#define AW_PID_2055_BOP_EN_ENABLE_VALUE	\
	(AW_PID_2055_BOP_EN_ENABLE << AW_PID_2055_BOP_EN_START_BIT)

#define AW_PID_2055_BOP_EN_DEFAULT_VALUE	(0)
#define AW_PID_2055_BOP_EN_DEFAULT		\
	(AW_PID_2055_BOP_EN_DEFAULT_VALUE << AW_PID_2055_BOP_EN_START_BIT)

/* BSTCTRL1 (0x60) detail */
/* BST_RTH bit 13:8 (BSTCTRL1 0x60) */
#define AW_PID_2055_BST_RTH_START_BIT	(8)
#define AW_PID_2055_BST_RTH_BITS_LEN	(6)
#define AW_PID_2055_BST_RTH_MASK		\
	(~(((1<<AW_PID_2055_BST_RTH_BITS_LEN)-1) << AW_PID_2055_BST_RTH_START_BIT))

#define AW_PID_2055_BST_RTH_DEFAULT_VALUE	(4)
#define AW_PID_2055_BST_RTH_DEFAULT		\
	(AW_PID_2055_BST_RTH_DEFAULT_VALUE << AW_PID_2055_BST_RTH_START_BIT)

/* BST_MODE bit 7:6 (BSTCTRL1 0x60) */
#define AW_PID_2055_BST_MODE_START_BIT	(6)
#define AW_PID_2055_BST_MODE_BITS_LEN	(2)
#define AW_PID_2055_BST_MODE_MASK		\
	(~(((1<<AW_PID_2055_BST_MODE_BITS_LEN)-1) << AW_PID_2055_BST_MODE_START_BIT))

#define AW_PID_2055_BST_MODE_TRANSPARENT	(0)
#define AW_PID_2055_BST_MODE_TRANSPARENT_VALUE	\
	(AW_PID_2055_BST_MODE_TRANSPARENT << AW_PID_2055_BST_MODE_START_BIT)

#define AW_PID_2055_BST_MODE_FORCE_BOOST	(1)
#define AW_PID_2055_BST_MODE_FORCE_BOOST_VALUE	\
	(AW_PID_2055_BST_MODE_FORCE_BOOST << AW_PID_2055_BST_MODE_START_BIT)

#define AW_PID_2055_BST_MODE_CLASS_G	(2)
#define AW_PID_2055_BST_MODE_CLASS_G_VALUE	\
	(AW_PID_2055_BST_MODE_CLASS_G << AW_PID_2055_BST_MODE_START_BIT)

#define AW_PID_2055_BST_MODE_CLASS_H	(3)
#define AW_PID_2055_BST_MODE_CLASS_H_VALUE	\
	(AW_PID_2055_BST_MODE_CLASS_H << AW_PID_2055_BST_MODE_START_BIT)

#define AW_PID_2055_BST_MODE_DEFAULT_VALUE	(0x3)
#define AW_PID_2055_BST_MODE_DEFAULT	\
	(AW_PID_2055_BST_MODE_DEFAULT_VALUE << AW_PID_2055_BST_MODE_START_BIT)

/* BST_ATH bit 5:0 (BSTCTRL1 0x60) */
#define AW_PID_2055_BST_ATH_START_BIT	(0)
#define AW_PID_2055_BST_ATH_BITS_LEN	(6)
#define AW_PID_2055_BST_ATH_MASK		\
	(~(((1<<AW_PID_2055_BST_ATH_BITS_LEN)-1) << AW_PID_2055_BST_ATH_START_BIT))

#define AW_PID_2055_BST_ATH_DEFAULT_VALUE	(2)
#define AW_PID_2055_BST_ATH_DEFAULT		\
	(AW_PID_2055_BST_ATH_DEFAULT_VALUE << AW_PID_2055_BST_ATH_START_BIT)

/* default value of BSTCTRL1 (0x60) */
/* #define AW_PID_2055_BSTCTRL1_DEFAULT		(0x04C2) */

/* BSTCTRL2 (0x61) detail */
/* BST_IPEAK bit 15:12 (BSTCTRL2 0x61) */
#define AW_PID_2055_BST_IPEAK_START_BIT	(12)
#define AW_PID_2055_BST_IPEAK_BITS_LEN	(4)
#define AW_PID_2055_BST_IPEAK_MASK		\
	(~(((1<<AW_PID_2055_BST_IPEAK_BITS_LEN)-1) << AW_PID_2055_BST_IPEAK_START_BIT))

#define AW_PID_2055_BST_IPEAK_1P5A		(0)
#define AW_PID_2055_BST_IPEAK_1P5A_VALUE	\
	(AW_PID_2055_BST_IPEAK_1P5A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_1P75A		(1)
#define AW_PID_2055_BST_IPEAK_1P75A_VALUE	\
	(AW_PID_2055_BST_IPEAK_1P75A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_2P0A		(2)
#define AW_PID_2055_BST_IPEAK_2P0A_VALUE	\
	(AW_PID_2055_BST_IPEAK_2P0A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_2P25A		(3)
#define AW_PID_2055_BST_IPEAK_2P25A_VALUE	\
	(AW_PID_2055_BST_IPEAK_2P25A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_2P5A		(4)
#define AW_PID_2055_BST_IPEAK_2P5A_VALUE	\
	(AW_PID_2055_BST_IPEAK_2P5A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_2P75A		(5)
#define AW_PID_2055_BST_IPEAK_2P75A_VALUE	\
	(AW_PID_2055_BST_IPEAK_2P75A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_3P0A		(6)
#define AW_PID_2055_BST_IPEAK_3P0A_VALUE	\
	(AW_PID_2055_BST_IPEAK_3P0A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_3P25A		(7)
#define AW_PID_2055_BST_IPEAK_3P25A_VALUE	\
	(AW_PID_2055_BST_IPEAK_3P25A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_3P5A		(8)
#define AW_PID_2055_BST_IPEAK_3P5A_VALUE	\
	(AW_PID_2055_BST_IPEAK_3P5A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_3P75A		(9)
#define AW_PID_2055_BST_IPEAK_3P75A_VALUE	\
	(AW_PID_2055_BST_IPEAK_3P75A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_4A		(10)
#define AW_PID_2055_BST_IPEAK_4A_VALUE	\
	(AW_PID_2055_BST_IPEAK_4A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_4P25A		(11)
#define AW_PID_2055_BST_IPEAK_4P25A_VALUE	\
	(AW_PID_2055_BST_IPEAK_4P25A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_4P50A		(12)
#define AW_PID_2055_BST_IPEAK_4P50A_VALUE	\
	(AW_PID_2055_BST_IPEAK_4P50A << AW_PID_2055_BST_IPEAK_START_BIT)

#define AW_PID_2055_BST_IPEAK_DEFAULT_VALUE	(9)
#define AW_PID_2055_BST_IPEAK_DEFAULT	\
	(AW_PID_2055_BST_IPEAK_DEFAULT_VALUE << AW_PID_2055_BST_IPEAK_START_BIT)

/* BST_TDEG bit 11:8 (BSTCTRL2 0x61) */
#define AW_PID_2055_BST_TDEG_START_BIT	(8)
#define AW_PID_2055_BST_TDEG_BITS_LEN	(4)
#define AW_PID_2055_BST_TDEG_MASK		\
	(~(((1<<AW_PID_2055_BST_TDEG_BITS_LEN)-1) << AW_PID_2055_BST_TDEG_START_BIT))

