LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88230/aw882xx_pid_2055_reg.h
#define AW_PID_2055_BST_TDEG_0P50_MS	(0)
#define AW_PID_2055_BST_TDEG_0P50_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_0P50_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_1P00_MS	(1)
#define AW_PID_2055_BST_TDEG_1P00_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_1P00_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_2P00_MS	(2)
#define AW_PID_2055_BST_TDEG_2P00_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_2P00_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_4P00_MS	(3)
#define AW_PID_2055_BST_TDEG_4P00_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_4P00_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_8P00_MS	(4)
#define AW_PID_2055_BST_TDEG_8P00_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_8P00_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_10P7_MS	(5)
#define AW_PID_2055_BST_TDEG_10P7_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_10P7_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_13P3_MS	(6)
#define AW_PID_2055_BST_TDEG_13P3_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_13P3_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_16P0_MS	(7)
#define AW_PID_2055_BST_TDEG_16P0_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_16P0_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_18P6_MS	(8)
#define AW_PID_2055_BST_TDEG_18P6_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_18P6_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_21P3_MS	(9)
#define AW_PID_2055_BST_TDEG_21P3_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_21P3_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_24P0_MS	(10)
#define AW_PID_2055_BST_TDEG_24P0_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_24P0_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_32P0_MS	(11)
#define AW_PID_2055_BST_TDEG_32P0_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_32P0_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_64P0_MS	(12)
#define AW_PID_2055_BST_TDEG_64P0_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_64P0_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_128_MS		(13)
#define AW_PID_2055_BST_TDEG_128_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_128_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_256_MS		(14)
#define AW_PID_2055_BST_TDEG_256_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_256_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_1200_MS	(15)
#define AW_PID_2055_BST_TDEG_1200_MS_VALUE	\
	(AW_PID_2055_BST_TDEG_1200_MS << AW_PID_2055_BST_TDEG_START_BIT)

#define AW_PID_2055_BST_TDEG_DEFAULT_VALUE	(11)
#define AW_PID_2055_BST_TDEG_DEFAULT	\
	(AW_PID_2055_BST_TDEG_DEFAULT_VALUE << AW_PID_2055_BST_TDEG_START_BIT)

/* BST_VOUT_SET bit 6:0 (BSTCTRL2 0x61) */
#define AW_PID_2055_BST_VOUT_SET_START_BIT	(0)
#define AW_PID_2055_BST_VOUT_SET_BITS_LEN	(7)
#define AW_PID_2055_BST_VOUT_SET_MASK	\
	(~(((1<<AW_PID_2055_BST_VOUT_SET_BITS_LEN)-1) << AW_PID_2055_BST_VOUT_SET_START_BIT))

#define AW_PID_2055_BST_VOUT_SET_3P5V	(0)
#define AW_PID_2055_BST_VOUT_SET_3P5V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P5V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_3P5625V	(1)
#define AW_PID_2055_BST_VOUT_SET_3P5625V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P5625V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_3P625V	(2)
#define AW_PID_2055_BST_VOUT_SET_3P625V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P625V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_3P6875V	(3)
#define AW_PID_2055_BST_VOUT_SET_3P6875V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P6875V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_3P75V	(4)
#define AW_PID_2055_BST_VOUT_SET_3P75V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P75V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_3P8125V	(5)
#define AW_PID_2055_BST_VOUT_SET_3P8125V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_3P8125V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_11P4375V	(127)
#define AW_PID_2055_BST_VOUT_SET_11P4375V_VALUE	\
	(AW_PID_2055_BST_VOUT_SET_11P4375V << AW_PID_2055_BST_VOUT_SET_START_BIT)

#define AW_PID_2055_BST_VOUT_SET_DEFAULT_VALUE	(0x58)
#define AW_PID_2055_BST_VOUT_SET_DEFAULT	\
	(AW_PID_2055_BST_VOUT_SET_DEFAULT_VALUE << AW_PID_2055_BST_VOUT_SET_START_BIT)

/* default value of BSTCTRL2 (0x61) */
/* #define AW_PID_2055_BSTCTRL2_DEFAULT		(0x9B58) */

/* detail information of registers end */
/********************************************
 * Volume Coefficient
 *******************************************/
#define AW_PID_2055_VOL_STEP		(6 * 8)
#define AW_PID_2055_VERSION_VALUE	(0x02A0)
#define AW_PID_2055A_VERSION_VALUE	(0x6708)


#define AW_PID_2055_MONITOR_VBAT_RANGE		(6025)
#define AW_PID_2055_MONITOR_INT_10BIT		(1023)
#define AW_PID_2055_MONITOR_TEMP_SIGN_MASK		(~(1<<9))
#define AW_PID_2055_MONITOR_TEMP_NEG_MASK		(0XFC00)

/********************************************
 * Init check
 *******************************************/
#define AW_PID_2055_INIT_CHECK_REG		(0x73)
#define AW_PID_2055_INIT_CHECK_VALUE		(0x1D40)
/********************************************
 * Dither
 *******************************************/
#define AW_PID_2055_DITHER_START_BIT	(14)
#define AW_PID_2055_DITHER_BITS_LEN	(1)
#define AW_PID_2055_DITHER_MASK	\
	(~(((1<<AW_PID_2055_DITHER_BITS_LEN)-1) << AW_PID_2055_DITHER_START_BIT))

#define AW_PID_2055_DITHER_DISABLE	(0)
#define AW_PID_2055_DITHER_DISABLE_VALUE	\
	(AW_PID_2055_DITHER_DISABLE << AW_PID_2055_DITHER_START_BIT)

#define AW_PID_2055_DITHER_ENABLE	(1)
#define AW_PID_2055_DITHER_ENABLE_VALUE	\
	(AW_PID_2055_DITHER_ENABLE << AW_PID_2055_DITHER_START_BIT)

#endif  /* #ifndef  __AW_PID_2055_REG_H__ */
